package xyz.saru.customcalendar.MyCalendar;

import android.graphics.Color;

/**
 * Created by SARU on 2015/04/19.
 */
public class MyCalendarCommon {
    //--------------------------------------------------------------------------------------------- 定数定義
    public final String TAG = "MyCalendarCommon";
    public static final int WEEKDAY = Color.BLACK;
    public static final int SATURDAY = Color.BLUE;
    public static final int HOLIDAY = Color.RED;
    public static final int UNSELECTED = Color.WHITE;
    public static final int SELECTED = Color.CYAN;

    //--------------------------------------------------------------------------------------------- メンバー

    //--------------------------------------------------------------------------------------------- イベントリスナー

    //--------------------------------------------------------------------------------------------- イベントサプライヤー

    //--------------------------------------------------------------------------------------------- Override

    //--------------------------------------------------------------------------------------------- コンストラクタ

    //--------------------------------------------------------------------------------------------- 主処理

    //--------------------------------------------------------------------------------------------- アクセサ

}
